#### SERIES:-
A series is 1-D labeled array capable of holding any data types as compare to array.
the axis labels are collectively called index.
INDEX == LABELS
array = [1,2,3,4,5]
series = [1,
         2,
         3,
         4,
         5]

In [3]:
import numpy as np
import pandas as pd

In [ ]:
# # Now see how to craete a series
# labels = ['a', 'b','c']  #  create labels
# my_list = [10,20,30]     # create list
# arr = np.array([10,20,30])    # create array
# d = {1:10,2:20,3:30}    # Create dictionary

# # now come to the series
# pd.Series(my_list)   # create series from list

# #  OUTPUT =
# # 0    10
# # 1    20
# # 2    30
# # dtype: int64

0    10
1    20
2    30
dtype: int64

In [ ]:
# #  So its show the by default index now i want to change that index also:
# labels = ['a', 'b','c']  #  create labels
# my_list = [10,20,30]     # create list
# arr = np.array([10,20,30])    # create array
# d = {1:10,2:20,3:30}    # Create dictionary
# pd.Series(my_list,index=labels)  # Simply pass my own indexes

# # #  OUTPUT--
# # a    10
# # b    20
# # c    30
# # dtype: int64

a    10
b    20
c    30
dtype: int64

In [ ]:
# #  Can i create a series by using array
# #  yes, but only 1D array is acceptable, because is also 1D
# labels = ['a', 'b','c']  #  create labels
# my_list = [10,20,30]     # create list
# arr = np.array([10,20,30])    # create array
# d = {1:10,2:20,3:30}    # Create dictionary
# pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [ ]:
# #  If i use dictionary for creating series, its automatically taken index as a keys
# # How?, see
# labels = ['a', 'b','c']  #  create labels
# my_list = [10,20,30]     # create list
# arr = np.array([10,20,30])    # create array
# d = {'a':10,'b':20,'c':30}    # Create dictionary
# pd.Series(d)
# # # OUTPUT--
# # a    10
# # b    20
# # c    30
# # dtype: int64

a    10
b    20
c    30
dtype: int64

#### DATAFRAMES:-
Combining multiple series is known as DATAFRAMES

In [10]:
import numpy as np
import pandas as pd

In [ ]:
# # Creating a dataframe by using dictionary
# data = {
#     'Name':['John','Anna','Peter','Linda'],
#     'Age' :[28,34,29,42],
#     'City' :['New York', 'Paris', 'Berlin', 'London'],
#     'Salary' :[65000,70000,62000,85000]
# }
# # Now craeting a dataframe from this data
# df = pd.DataFrame(data)

# df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
# # Creating a dataframe by using list
# data_list = [
#     ['John',28,'New York',65000],
#     ['Anna',34,'Paris',70000],
#     ['Peter',29,'Berlin',62000],
#     ['Linda',42,'London',85000]
# ]

# df2 = pd.DataFrame(data_list)
# # Whwn i used dictionary, they provide me a column name which is my key
# # But what can i do , if i want to add header(column name) like the above one
# col = ['Name','Age','City','Salary']
# # now i want to use this name in df2, so :-
# df2 = pd.DataFrame(data_list,columns=col)
# df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
# # Selection and Indexing of column:-
# # so now if i want to target any column, how can i do that
# # df2[0], now worked like that
# # I have to pass column name in df2, like that:-
# df2['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [ ]:
# # But what if i want to call more than one column
# # so i pass list in df2, like that:-
# df2[['Name', 'City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [ ]:
# # You can also add column directlt, lie this:-
# df2['Designation'] = ['Doctor', 'Engineer', 'HR', 'CA']

In [ ]:
# Now I call my dataframe:-
df2
#  here i get new column of designation

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000          HR
3  Linda   42    London   85000          CA

In [ ]:
# # now see how to remove column:
# df2.drop('Designation',axis=1)
# # axis is required, axis=0 == row and axis=1 == column
# #  so designation column is removed

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
# # but when i call my dataframe again, its show designation column again
# #  so for that , i use inplace here,
# # what it does, let see, it removes designation column from my original dataframe
# df2.drop('Designation',axis=1,inplace=True)
# df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
# # So that's all about column, but what if i want to do this ops on rows
# # lets see , how it works on rows:-
# #  what if i want to select 1st row :- John	28	New York	65000

# df2.loc[0]  # loc use for location of rows
# # # OUTPUT---
# # Name          John
# # Age             28
# # City      New York
# # Salary       65000
# # Name: 0, dtype: object

# # Can i use multiple rows at onces, yes :-
# df2.loc[[0,1]]

# #  we can also use iloc for index location

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [ ]:
# # Selecting subsets of row and column
# #  how?....... see below
# #  I want o target only this:- New York	65000 , Paris	70000
# # I can select rows and column at once:-
# # df2.loc[[0,1]][['City','Salary']]

# # OUTPUT:-
# # City	Salary
# # 0	New York	65000
# # 1	Paris	70000

# # now i want to target name and age portion of peter and linda

# df2.loc[[2,3]][['Name','Age']]
# #  OUTPUT ---
# # 	Name	Age
# # 2	Peter	29
# # 3	Linda	42

    Name  Age
2  Peter   29
3  Linda   42

In [ ]:
# # Conditional Selection:-
# #  I only want to see those people whose age is more than 30
# df2[df2["Age"] >30]

# # OUTPUT ---
# # 	Name	Age	City	Salary
# # 1	Anna	34	Paris	70000
# # 3	Linda	42	London	85000

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [ ]:
# #  Now i only want people whose age is above 30 and their city must be paris
# df2[(df2["Age"] >30) & (df2["City"]=='Paris')]

# #  Use parentheses for specific condtion 
# # OUTPUT - ---

# #   Name	Age	City	Salary
# # 1	Anna	34	Paris	70000

   Name  Age   City  Salary
1  Anna   34  Paris   70000

#### MISSING DATA:-

In [39]:
import numpy as np
import pandas as pd

In [41]:
# FIND MISSING DATA
data = {
    'A':[1,2,np.nan,4,5],
    'B':[np.nan,2,3,4,5],
    'C':[1,2,3,np.nan,np.nan],
    'D':[1,np.nan,np.nan,np.nan,5]
}

df = pd.DataFrame(data)

In [42]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [43]:
# Now i use isna fumction to know null values in boolean
df.isna()

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [44]:
# Now I want to count all nullvalues:-
df.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

In [ ]:
#  now i want to , all the rows have null value or any of the rows have all values
# so i use any() here to know that:-
df.isna().any()

# so here all the rows have nullvalues

A    True
B    True
C    True
D    True
dtype: bool